UberData

In [1]:
# 2014 Uberdata_ processing

# Dependencies
from pathlib import Path
import pandas as pd


# Path to 2014data CSV file 
Uber_trips_apr14 = Path("Raw_Data/uber-raw-data-apr14.csv")
Uber_trips_may14 = Path("Raw_Data/uber-raw-data-may14.csv")
Uber_trips_jun14 = Path("Raw_Data/uber-raw-data-jun14.csv")
Uber_trips_jul14 = Path("Raw_Data/uber-raw-data-jul14.csv")
Uber_trips_aug14 = Path("Raw_Data/uber-raw-data-aug14.csv")
Uber_trips_sep14 = Path("Raw_Data/uber-raw-data-sep14.csv")


# to check the data structure load the one of the CSV data into a DataFrame
df_apr14 = pd.read_csv(Uber_trips_apr14)

# Display the first few rows of the DataFrame

df_apr14.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [5]:
# Read all CSV file into DataFrame
df_apr14 = pd.read_csv(Uber_trips_apr14)
df_may14 = pd.read_csv(Uber_trips_may14)
df_jun14 = pd.read_csv(Uber_trips_jun14)
df_jul14 = pd.read_csv(Uber_trips_jul14)
df_aug14 = pd.read_csv(Uber_trips_aug14)
df_sep14 = pd.read_csv(Uber_trips_sep14)

# Concatenate all DataFrames into one
combined_df = pd.concat([df_apr14, df_may14, df_jun14, df_jul14, df_aug14, df_sep14], ignore_index=True)

combined_df.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [6]:
# Count the number of rows in combined_df
num_rows = len(combined_df)
print("Number of rows in combined_df:", num_rows)

Number of rows in combined_df: 4534327

In [7]:
# Check for missing data
missing_data = combined_df.isnull()

# Summarize missing data counts
missing_counts = missing_data.sum()

# Print or use missing_counts as needed
print("Missing data counts:")
print(missing_counts)

Missing data counts:
Date/Time    0
Lat          0
Lon          0
Base         0
dtype: int64

In [8]:
# Check for duplicates
duplicates = combined_df.duplicated()

# Count the number of duplicates
num_duplicates = duplicates.sum()

# Print or use num_duplicates as needed
print("Number of duplicate rows in combined_df:", num_duplicates)

Number of duplicate rows in combined_df: 82581

In [9]:
# Remove duplicates- check with others whether it's a correct approach
combined_df_cleaned = combined_df.drop_duplicates().copy()

# Print the shape to see how many rows are left after removing duplicates
print("Shape of cleaned DataFrame:", combined_df_cleaned.shape)

combined_df_cleaned = combined_df.drop_duplicates().copy()

Shape of cleaned DataFrame: (4451746, 4)

In [21]:
combined_df_cleaned.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [10]:
combined_df_cleaned.tail()

                  Date/Time      Lat      Lon    Base
4534322  9/30/2014 22:57:00  40.7668 -73.9845  B02764
4534323  9/30/2014 22:57:00  40.6911 -74.1773  B02764
4534324  9/30/2014 22:58:00  40.8519 -73.9319  B02764
4534325  9/30/2014 22:58:00  40.7081 -74.0066  B02764
4534326  9/30/2014 22:58:00  40.7140 -73.9496  B02764

In [11]:
# OPTION: I crossed check the duplicate with an alternative method. Drop duplicate rows based on specific columns and count unique rows
unique_rows = combined_df.drop_duplicates(subset=['Date/Time', 'Lat', 'Lon', 'Base']).shape[0]

print("Number of unique rows based on 'Date/Time', 'Lat', 'Lon', 'Base':", unique_rows)

Number of unique rows based on 'Date/Time', 'Lat', 'Lon', 'Base': 4451746

In [16]:
#2015 data_data1
Uber_trips_janjune_15 = Path("Raw_Data/uber-raw-data-janjune-15.csv")

# Load the CSV data into a DataFrame
df1 = pd.read_csv(Uber_trips_janjune_15)
df1.head()

  Dispatching_base_num          Pickup_date Affiliated_base_num  locationID
0               B02617  2015-05-17 09:47:00              B02617         141
1               B02617  2015-05-17 09:47:00              B02617          65
2               B02617  2015-05-17 09:47:00              B02617         100
3               B02617  2015-05-17 09:47:00              B02774          80
4               B02617  2015-05-17 09:47:00              B02617          90

In [15]:
#2015 data_data2: Uber_trips_JanFeb_15
Uber_trips_JanFeb_15= Path("Raw_Data/Uber-Jan-Feb-FOIL.csv")

# Load the CSV data into a DataFrame
df2 = pd.read_csv(Uber_trips_JanFeb_15)
df2.head()

  dispatching_base_number      date  active_vehicles  trips
0                  B02512  1/1/2015              190   1132
1                  B02765  1/1/2015              225   1765
2                  B02764  1/1/2015             3427  29421
3                  B02682  1/1/2015              945   7679
4                  B02617  1/1/2015             1228   9537